In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('titanic.csv')

In [3]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [5]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [6]:
df["Survived"].value_counts()

0    549
1    342
Name: Survived, dtype: int64

In [7]:
df.groupby("Pclass")["Survived"].mean()

Pclass
1    0.629630
2    0.472826
3    0.242363
Name: Survived, dtype: float64

In [8]:
df.groupby("Sex")["Survived"].mean()

Sex
female    0.742038
male      0.188908
Name: Survived, dtype: float64

In [9]:
df.groupby('Survived')['Age'].mean()

Survived
0    30.626179
1    28.343690
Name: Age, dtype: float64

In [10]:
df.groupby("SibSp")["Survived"].mean().sort_values()

SibSp
5    0.000000
8    0.000000
4    0.166667
3    0.250000
0    0.345395
2    0.464286
1    0.535885
Name: Survived, dtype: float64

In [11]:
df.groupby("Parch")["Survived"].mean().sort_values()

Parch
4    0.000000
6    0.000000
5    0.200000
0    0.343658
2    0.500000
1    0.550847
3    0.600000
Name: Survived, dtype: float64

In [12]:
df.groupby('Survived')['Fare'].mean()

Survived
0    22.117887
1    48.395408
Name: Fare, dtype: float64

In [13]:
df.groupby("Embarked")["Survived"].mean()

Embarked
C    0.553571
Q    0.389610
S    0.336957
Name: Survived, dtype: float64

In [14]:
df.groupby(["Pclass", "Sex"])["Survived"].mean()

Pclass  Sex
1       female    0.968085
        male      0.368852
2       female    0.921053
        male      0.157407
3       female    0.500000
        male      0.135447
Name: Survived, dtype: float64

In [15]:
df[df["Age"].isnull()]["Survived"].value_counts()

0    125
1     52
Name: Survived, dtype: int64

## Name 전처리

In [16]:
df['Title'] = df['Name'].str.extract('([A-Za-z]+)\.')

In [17]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Title
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,Mr
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Mrs
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Miss
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,Mrs
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,Mr

## Age 전처리

In [18]:
df['Title'].value_counts()

Mr          517
Miss        182
Mrs         125
Master       40
Dr            7
Rev           6
Mlle          2
Major         2
Col           2
Countess      1
Capt          1
Ms            1
Sir           1
Lady          1
Mme           1
Don           1
Jonkheer      1
Name: Title, dtype: int64

In [19]:
df['Title'].unique()

array(['Mr', 'Mrs', 'Miss', 'Master', 'Don', 'Rev', 'Dr', 'Mme', 'Ms',
       'Major', 'Lady', 'Sir', 'Mlle', 'Col', 'Capt', 'Countess',
       'Jonkheer'], dtype=object)

In [20]:
title_list = df['Title'].unique()

In [21]:
title_mapping = dict()
for key, index in enumerate(title_list):
    if key >= 3:
        title_mapping[index] = 3
    else:
        title_mapping[index] = key

In [22]:
title_mapping

{'Mr': 0,
 'Mrs': 1,
 'Miss': 2,
 'Master': 3,
 'Don': 3,
 'Rev': 3,
 'Dr': 3,
 'Mme': 3,
 'Ms': 3,
 'Major': 3,
 'Lady': 3,
 'Sir': 3,
 'Mlle': 3,
 'Col': 3,
 'Capt': 3,
 'Countess': 3,
 'Jonkheer': 3}

In [23]:
df['Title2'] = df['Title'].map(title_mapping)

In [24]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Title,Title2
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,Mr,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Mrs,1
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Miss,2
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,Mrs,1
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,Mr,0

In [25]:
df.groupby('Title2')['Survived'].mean()

Title2
0    0.156673
1    0.792000
2    0.697802
3    0.522388
Name: Survived, dtype: float64

In [26]:
df.groupby('Title2')['Age'].mean()

Title2
0    32.368090
1    35.898148
2    21.773973
3    20.430161
Name: Age, dtype: float64

In [27]:
df.groupby('Title2')['Age'].median()

Title2
0    30.0
1    35.0
2    21.0
3     9.0
Name: Age, dtype: float64

In [28]:
df['Age'].isnull().sum()

177

In [29]:
df.groupby('Title2')['Age'].transform("median")

0      30.0
1      35.0
2      21.0
3      35.0
4      30.0
       ...
886     9.0
887    21.0
888    21.0
889    30.0
890    30.0
Name: Age, Length: 891, dtype: float64

In [30]:
df['Age'].fillna(df.groupby('Title2')['Age'].transform("median"))

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888    21.0
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [31]:
df['Age'] = df['Age'].fillna(df.groupby('Title2')['Age'].transform("median"))

In [32]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
Title            0
Title2           0
dtype: int64

In [39]:
df.loc[df['Age'] <= 16, 'Age2'] = 0
df.loc[(17 <= df['Age']) & (df['Age'] <= 26), 'Age2'] = 1
df.loc[(27 <= df['Age']) & (df['Age'] <= 36), 'Age2'] = 2
df.loc[(37 <= df['Age']) & (df['Age'] <= 62), 'Age2'] = 3
df.loc[df['Age'] >= 63, 'Age2'] = 4

In [40]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Title,Title2,Sex2,Age2
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,Mr,0,0,1.0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Mrs,1,1,3.0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Miss,2,1,1.0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,Mrs,1,1,2.0
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,Mr,0,0,2.0

In [41]:
df.groupby('Age2')['Survived'].mean()

Age2
0.0    0.542857
1.0    0.380392
2.0    0.345238
3.0    0.385475
4.0    0.200000
Name: Survived, dtype: float64

## Sex 전처리

In [33]:
df['Sex'].value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [34]:
sex_mapping = {'male':0, 'female':1}
df['Sex2'] = df['Sex'].map(sex_mapping)

In [35]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Title,Title2,Sex2
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,Mr,0,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Mrs,1,1
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Miss,2,1
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,Mrs,1,1
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,Mr,0,0

In [36]:
df['Sex2'].value_counts()

0    577
1    314
Name: Sex2, dtype: int64

## Embarked 전처리

In [44]:
df[df['Pclass'] == 1]['Embarked'].value_counts()

S    127
C     85
Q      2
Name: Embarked, dtype: int64

In [45]:
df[df['Pclass'] == 2]['Embarked'].value_counts()

S    164
C     17
Q      3
Name: Embarked, dtype: int64

In [46]:
df[df['Pclass'] == 3]['Embarked'].value_counts()

S    353
Q     72
C     66
Name: Embarked, dtype: int64

In [48]:
df['Embarked'].fillna('S', inplace=True)

In [50]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         0
Title            0
Title2           0
Sex2             0
Age2             1
dtype: int64

In [53]:
embarked_mapping = {'S':0, 'C':1, 'Q':2}
df['Embarked2'] = df['Embarked'].map(embarked_mapping)

In [54]:
df['Embarked'].value_counts()

S    646
C    168
Q     77
Name: Embarked, dtype: int64

In [55]:
df['Embarked2'].value_counts()

0    646
1    168
2     77
Name: Embarked2, dtype: int64

## Fare 전처리

In [62]:
df.loc[df['Fare'] <= 17, 'Fare2'] = 0
df.loc[(17 < df['Fare']) & (df['Fare'] <= 30), 'Fare2'] = 1
df.loc[(30 < df['Fare']) & (df['Fare'] <= 100), 'Fare2'] = 2
df.loc[df['Fare'] > 100, 'Fare2'] = 3

In [63]:
df['Fare2'].value_counts()

0.0    496
2.0    181
1.0    161
3.0     53
Name: Fare2, dtype: int64

## Cabin 전처리

In [67]:
df[~df['Cabin'].isnull()]['Cabin']

1              C85
3             C123
6              E46
10              G6
11            C103
          ...
871            D35
872    B51 B53 B55
879            C50
887            B42
889           C148
Name: Cabin, Length: 204, dtype: object

In [78]:
df['Cabin2'] = df['Cabin'].str[0]

In [79]:
df['Cabin2'].value_counts()

C    59
B    47
D    33
E    32
A    15
F    13
G     4
T     1
Name: Cabin2, dtype: int64

In [80]:
df[df['Pclass'] == 1]['Cabin2'].unique()

array(['C', 'E', 'A', nan, 'B', 'D', 'T'], dtype=object)

In [81]:
df[df['Pclass'] == 2]['Cabin2'].unique()

array([nan, 'D', 'F', 'E'], dtype=object)

In [82]:
df[df['Pclass'] == 3]['Cabin2'].unique()

array([nan, 'G', 'F', 'E'], dtype=object)

In [83]:
cabin_mapping = {'A':0, 'B':0.4, 'C':0.8, 'D':1.2, 'E':1.6, 'F':2, 'G':2.4, 'T':2.8}
df['Cabin2'] = df['Cabin2'].map(cabin_mapping)

In [87]:
df.groupby('Pclass')['Cabin2'].transform('median')

0      2.0
1      0.8
2      2.0
3      0.8
4      2.0
      ...
886    1.8
887    0.8
888    2.0
889    0.8
890    2.0
Name: Cabin2, Length: 891, dtype: float64

In [88]:
df['Cabin2'].fillna(df.groupby('Pclass')['Cabin2'].transform('median'), inplace=True)

In [90]:
df['Cabin2'].value_counts()

2.0    492
1.8    168
0.8     99
0.4     47
1.2     33
1.6     32
0.0     15
2.4      4
2.8      1
Name: Cabin2, dtype: int64

## Family Size

In [91]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Title,Title2,Sex2,Age2,Embarked2,Fare2,Cabin2
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,Mr,0,0,1.0,0,0.0,2.0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Mrs,1,1,3.0,1,2.0,0.8
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Miss,2,1,1.0,0,0.0,2.0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,Mrs,1,1,2.0,0,2.0,0.8
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,Mr,0,0,2.0,0,0.0,2.0

In [92]:
df['FamilySize'] = df['SibSp'] + df['Parch'] + 1

In [95]:
df[df['FamilySize'] == 0]

Empty DataFrame
Columns: [PassengerId, Survived, Pclass, Name, Sex, Age, SibSp, Parch, Ticket, Fare, Cabin, Embarked, Title, Title2, Sex2, Age2, Embarked2, Fare2, Cabin2, FamilySize]
Index: []

In [96]:
df['FamilySize'].unique()

array([ 2,  1,  5,  3,  7,  6,  4,  8, 11], dtype=int64)

In [105]:
family_mapping = {}
for value in range(1, df['FamilySize'].max()+1):
    family_mapping[value] = round((value-1) * 0.4, 2)
family_mapping

{1: 0.0,
 2: 0.4,
 3: 0.8,
 4: 1.2,
 5: 1.6,
 6: 2.0,
 7: 2.4,
 8: 2.8,
 9: 3.2,
 10: 3.6,
 11: 4.0}

In [106]:
df['FamilySize'] = df['FamilySize'].map(family_mapping)

In [107]:
df['FamilySize'].value_counts()

0.0    537
0.4    161
0.8    102
1.2     29
2.0     22
1.6     15
2.4     12
4.0      7
2.8      6
Name: FamilySize, dtype: int64